{"sections":{"breadcrumbs_RzgTi9":{"type":"breadcrumbs","settings":{"container":"fixed","text_alignment":"start","padding_top":20,"padding_bottom":20}},"main":{"type":"main-page","disabled":true,"custom_css":[],"settings":{"container":"fixed","text_alignment":"center","padding_top":60,"padding_bottom":0}},"rich_text_jCHQj3":{"type":"rich-text","blocks":{"heading_dYUFqX":{"type":"heading","settings":{"heading":"Entrepreneur Starter Kit","highlight_style":"none","highlight_font_style":"italic","highlight_style_color":"","highlight_text_color":"","heading_size":"h2"}},"heading_9XTAzg":{"type":"heading","settings":{"heading":"How to Start a Gumball Machine Business","highlight_style":"none","highlight_font_style":"italic","highlight_style_color":"","highlight_text_color":"","heading_size":"h2"}},"text_BWDney":{"type":"text","settings":{"text":"<p>Looking to start your very own gumball machine business? This how-to guide will help you get started, teach you how to calculate your profit, show you tips and tricks and everything else you need to get started with your gumball machine business.<br\/><br\/>One of the first questions we often get is \"how much money does a gumball machine make?\" or \"can I really make money with a gumball machine?\" and there are really a number of factors that go into answering those questions. According to the Vending Times, the national average is $1 per head or about $30 per month. Some machines, like our best selling Triple Shop, have 3 separate compartments and function as 3 separate heads. If you have any machines making less than $15 per month, you may want to consider pulling the machine and moving it to a new location. <br\/><br\/><strong>Call us with any questions at 1-800-853-3941<\/strong><\/p>","text_size":"text-base","text_line_limit":"none","button_style":"btn--underline","button_icon":"none"}}},"block_order":["heading_dYUFqX","heading_9XTAzg","text_BWDney"],"name":"t:sections.rich-text.name","settings":{"container":"fixed","color_scheme":"","use_color_scheme_in_container":false,"content_spacing":"standard","content_alignment":"left","padding_top":0,"padding_bottom":0,"show_section_divider":false,"divider_width":"fixed"}},"rich_text_ytzC3c":{"type":"rich-text","blocks":{"heading_PV36PQ":{"type":"heading","settings":{"heading":"Having a Business Plan","highlight_style":"none","highlight_font_style":"italic","highlight_style_color":"","highlight_text_color":"","heading_size":"h2"}},"text_wjDcN7":{"type":"text","settings":{"text":"<ol><li><strong>Determine your budget<\/strong> - It's important that you start with a budget that you can afford. Allow your business to pay for itself by reinvesting your profits directly back into the business until you grow your route to your optimal number of locations.<\/li><li><strong>Set goals<\/strong> - All business plans should have goals, budgets, and a forecast. Set goals that are realistic and raise the bar once those are met. <\/li><li><strong>Finding great locations<\/strong> - The old adage - LOCATION, LOCATION, LOCATION - Like any business, where your gumball machines are located is one of the most important factors when trying to determine how much money you can make. <\/li><li><strong>Build relationships<\/strong> - Know your customers - selecting the right candy and gumballs for the location is also a key factor. Often times, you may find that the employees who work at your locations are your best customers. If given the opportunity, ask the employees what their favorite candy is and make changes if needed. Do you have a location with a lot of kids vising? If so, you may want to select items that the kids will love (think Skittles, Nerds Gumballs, Mike and Ikes, or even toys) Is it mostly an adult location? If so, you may want to look at Peanut M&M's, Hot Tamales, or even Mints.<\/li><li><strong>Find a reliable supplier<\/strong> - CandyMachines.com is a factory-direct supplier and we have a full line of gumball machines and all the supplies at wholesale prices.<\/li><li><strong>Calculate your profit<\/strong> - In order to calculate your profit, you need to understand all your expenses. Use our <a href=\"https:\/\/www.candymachines.com\/Gumball-Profit-Calculator.aspx\">Gumball Profit Calculator<\/a> to help you understand what your profit would be and to set goals that match your business plan.<\/li><\/ol>","text_size":"text-base","text_line_limit":"none","button_style":"btn--underline","button_icon":"none"}}},"block_order":["heading_PV36PQ","text_wjDcN7"],"name":"t:sections.rich-text.name","settings":{"container":"fixed","color_scheme":"","use_color_scheme_in_container":false,"content_spacing":"standard","content_alignment":"left","padding_top":30,"padding_bottom":0,"show_section_divider":false,"divider_width":"fixed"}},"rich_text_Q8djJP":{"type":"rich-text","blocks":{"heading_7Ga3NF":{"type":"heading","settings":{"heading":"Starting your Gumball Machine Business","highlight_style":"none","highlight_font_style":"italic","highlight_style_color":"","highlight_text_color":"","heading_size":"h2"}},"text_pjapfD":{"type":"text","settings":{"text":"<p>Once you've done all your homework, found reputable suppliers, calculated your expenses and profit, and come up with a business plan, you're ready to get started. Here are the steps to get started:<\/p><ol><li><strong>Come up with a business name<\/strong>  - We always suggest getting business cards, t-shirts, and a business website. This helps legitimize your gumball machine business when your out securing locations or servicing your routes. <\/li><li><strong>Start an LLC or Register your Business<\/strong>. Each state is different but most states have a quick and easy way to set up an LLC online.<\/li><li><strong>Open a business bank account<\/strong> - As you grow your business, having an LLC and business bank account can help you secure a business line of credit or even a business credit card to manage the expenses for your growing business. Plus, the credit card points really add up! <\/li><li><strong>Check local laws and regulations<\/strong> - Check your local laws and regulations for vending machines or coin-operated machines. Many states have different regulations depending on the number of machines within your route. We have a guide with all 50 states to help you get started. <a href=\"\/pages\/vending-regulations-by-state\" title=\"Vending Regulations by State\">https:\/\/www.candymachines.com\/pages\/Vending-Regulations-by-State<\/a><\/li><li><strong>Secure your first locations<\/strong> - Securing your first location is a huge step when starting a gumball machine business. This is when all your hard work starts to pay off! <\/li><li><strong>Purchase your first gumball machines and supplies<\/strong> - find a reputable supplier for your equipment and supplies. <\/li><\/ol>","text_size":"text-base","text_line_limit":"none","button_style":"btn--underline","button_icon":"none"}}},"block_order":["heading_7Ga3NF","text_pjapfD"],"name":"t:sections.rich-text.name","settings":{"container":"fixed","color_scheme":"","use_color_scheme_in_container":false,"content_spacing":"standard","content_alignment":"left","padding_top":30,"padding_bottom":0,"show_section_divider":false,"divider_width":"fixed"}},"rich_text_J8nU9a":{"type":"rich-text","blocks":{"heading_Ukimkr":{"type":"heading","settings":{"heading":"Finding Gumball Machine Locations","highlight_style":"none","highlight_font_style":"italic","highlight_style_color":"","highlight_text_color":"","heading_size":"h2"}},"text_aYGrbd":{"type":"text","settings":{"text":"<p>It's always important to remember that a gumball machine will not place itself. like any successful business, a gumball machine business takes a lot of preparation and hard work.  We always advise new operators to start small and secure your locations before making your first purchase. Here are some tips on finding great locations:<\/p><ol><li><strong>Finding Locations<\/strong>  - Start with the business you frequent and within your neighborhoods. Talking to the business owners you already know is always a good place to start when trying secure locations. You probably know your neighborhood better than anyone else and you should use that to your advantage when looking for new locations. <\/li><li><strong>Partner with a Charity<\/strong> - Partnering with a Charity is always a great way to introduce your pitch to business owners when asking to put a machine in their establishment. Again, you may want to consider local charities that support causes within your community. Not only can this help you in securing location, it's also a great way to increase sales an help a great cause!<\/li><li><strong>Buy new machines<\/strong> - When you tell a business owner that you're going to put a brand new machine in their establishment, they are more likely to say YES. Most business owners don't want old, worn-out equipment front and center in their establishment. Offering to put new equipment in their business goes a long way. Also, make sure you properly maintain your equipment so it's still \"like new\" should you ever need to change locations.<\/li><li><strong>Use a locating service<\/strong> - We only advise you to do this if you find a reputable locator with a proven track record. Check their reviews and ask for references. <\/li><\/ol>","text_size":"text-base","text_line_limit":"none","button_style":"btn--underline","button_icon":"none"}}},"block_order":["heading_Ukimkr","text_aYGrbd"],"name":"t:sections.rich-text.name","settings":{"container":"fixed","color_scheme":"","use_color_scheme_in_container":false,"content_spacing":"standard","content_alignment":"left","padding_top":30,"padding_bottom":50,"show_section_divider":false,"divider_width":"fixed"}}},"order":["breadcrumbs_RzgTi9","main","rich_text_jCHQj3","rich_text_ytzC3c","rich_text_Q8djJP","rich_text_J8nU9a"]}